Repository: kiddac/KiddaC_Skin_E2sentials
Catalog: KiddaC_Skin_E2sentials/usr/lib/enigma2/python/Plugins/Extensions/KiddaC_Skin_E2sentials/locale/*/LC_MESSAGES/KiddaC_Skin_E2sentials.po
Languages: ar

source: Waiting
ar: إنتظر من فضلك

source: In progress
ar: جاري التنفيذ

source: Finished
ar: تم الإنتهاء

source: Failed
ar: فشل

source: An unknown error occurred!
ar: حدث خطأ غير معروف!

source: A required tool (%s) was not found.
ar: لم يتم العثور (%s) على الأداة المطلوبة.

source: Error code
ar: رمز خطأ

source: Trashcan
ar: سلة المهملات

source: Deleted items
ar: العناصر المحذوفة

source: Deleted Recordings
ar: التسجيلات المحذوفة

source: Directory
ar: الدليل

source: Trash can
ar: سلة المهملات

source: %d Min
ar: %d دقيقه

source: %d Recording
ar: التسجيل %d

source: Movie List Setup
ar: ضبط قائمة الأفلام

source: Cancel
ar: ألغاء

source: OK
ar: موافق

source: Use movie planner layout mod
ar: استخدام تعديل تخطيط مخطط الأفلام

source: Use alternative movie planner layouts. Primarily for for KiddaC's skins, but compatible with some other skins.
ar: استخدم تخطيطات مخطط أفلام بديلة. في المقام الأول لإسكينات كيداك ، ولكنه متوافق مع بعض الإسكينات الأخرى.

source: Use trash can in movie list
ar: استخدام سلة المهملات في قائمة الأفلام

source: When enabled, deleted recordings are moved to the trash can, instead of being deleted immediately.
ar: عند التفعيل ، سيتم نقل التسجيلات المحذوفة إلى سلة المهملات ، بدلا من أن يتم حذفها على الفور.

source: Remove items from trash can after (days)
ar: إزالة العناصر من سلة المهملات بعد { أيام

source: Configure the number of days after which items are automatically removed from the trash can. A setting of 0 disables this.
ar: إعدادات ضبط عدد الأيام وبعد ذلك يتم إزالة العناصر تلقائيا من سلة المهملات. ضبط 0 لتعطيل هذا الخيار.

source: Clean network trash cans
ar: تنظيف شبكة الانترنت من سلة المهملات

source: When enabled, network trash cans are probed for cleaning.
ar: عند التفعيل، يتم البحث عن سلة محذوفات الشبكة لتنظيفها.

source: Disk space to reserve for recordings (in GB)
ar: مساحة القرص الصلب للتسجيلات (بالجيجا بايت)

source: Configure the minimum amount of disk space to be available for recordings. When the amount of space drops below this value, deleted items will be removed from the trash can.
ar: ضبط إعدادات الحد الأدنى من مساحة القرص لتكون متاحة للتسجيلات. عندما ينخفض ​​مقدار المساحة أقل من هذه القيمة، سيتم إزالة العناصر المحذوفة من سلة المهملات.

source: Background delete option
ar: خيار حذف الخلفية

source: Configure on which devices the background delete option should be used.
ar: ضبط استخدام خيار حذف الخلفية على اي أجهزة.

source: Background delete speed
ar: سرعة حذف الخلفية

source: Configure the speed of the background deletion process. Lower speed will consume less hard disk drive performance.
ar: تكوين إعدادات سرعة عملية الحذف في الخلفية. إنخفاض السرعة سوف يكون الاستهلاك أقل في أداء القرص الصلب.

source: Font size
ar: حجم الخط

source: This allows you change the font size relative to skin size, so 1 increases by 1 point size, and -1 decreases by 1 point size
ar: يسمح لك هذا بتغيير حجم الخط في الإسكين زيادة بمقدار 1 حسب حجم الخط, و إنقاص -1 حسب حجم الخط

source: Number of rows
ar: عدد الصفوف

source: Number of rows to display
ar: عدد الصفوف المراد عرضها

source: Use slim screen
ar: استخدام شاشة رفيعه

source: Use the alternative screen
ar: استخدم الشاشة البديلة

source: Use adaptive date display
ar: استخدام تاريخ متأقلم على شاشة العرض

source: Adaptive date display allows recent dates to be displayed as 'Today' or 'Yesterday'. It hides the year for recordings made this year. It hides the day of the week for recordings made in previous years.
ar: يسمح عرض التاريخ على شاشة العرض التواريخ الحديثة علي انها 'اليوم' أو 'أمس'. انه يخفي السنه للتسجيلات التي تمت هذا العام. هو يخفي اليوم من الأسبوع لتسجيلات يجعل في السنوات السابقة.

source: Sort
ar: ترتيب

source: Set the default sorting method.
ar: تعيين الشكل الإفتراضي في الفرز.

source: Sort Trash by deletion time
ar: ترتيب المحذوفات حسب وقت الحذف

source: Use the deletion time to sort Trash directories. Most recently deleted at the top.
ar: استخدام وقت الحذف لفرز مجلدات سلة المهملات. تم حذفها مؤخرا في الأعلى.

source: Show extended description
ar: عرض الوصف المتقدم

source: Show or hide the extended description, (skin dependant).
ar: عرض أو إخفاء الوصف الكامل (يتبع الإسكين)

source: Use individual settings for each directory
ar: استخدام الإعدادات الفردية لكل دليل

source: When set, each directory will show the previous state used. When off, the default values will be shown.
ar: عند التعيين ، سيعرض كل دليل الحالة السابقة المستخدمة. عند إيقاف التشغيل، سيتم عرض القيم الافتراضية.

source: Permanent sort key changes
ar: تغييرات مفتاح الترتيب الدائم

source: When set, sort changes via the sort key will be permanent.
ar: عند التحديد ، ستكون تغييرات الترتيب عبر مفتاح الفرز دائمة.

source: When unset, sort changes will be temporary - just for this view of a directory.
ar: عند إلغاء الضبط ، ستكون تغييرات الترتيب مؤقتة - فقط لطريقة العرض هذه للدليل.

source: Stop service on return to movie list
ar: إيقاف خدمة الرجوع لقائمة الأفلام

source: Stop previous broadcasted service on return to movie list.
ar: إيقاف خدمة البث السابقة بشأن العودة إلى قائمة الأفلام.

source: Show status icons in movie list
ar: عرض الإيقونات في قائمة الأفلام

source: Shows the watched status of the movie.
ar: عرض حالة الأفلام المشاهدة.

source: Show icon for new/unseen items
ar: عرض الايقونات الجديدة أو إخفاءها

source: Shows the icons when new/unseen, otherwise it will not show an icon.
ar: عرض الايقونات عندما تكون جديدة/غير مرئية، وإلا فإنه لن تعرض الايقونة.

source: Service Title mode
ar: وضع عنوان الحدث

source: Show picons in the movie list.
ar: عرض البيكونات في قائمة الأفلام.

source: Picon Width
ar: عرض الايقونة

source: Show movie lengths in movie list
ar: إظهار أطوال الأفلام في قائمة الأفلام

source: When enabled, the length of each recording will be shown in the movielist (this might cause some additional loading time).
ar: عند التمكين، سيتم عرض طول التسجيل في قائمة الأفلام (وهذا قد يسبب بعض الوقت تحميل إضافي).

source: Play audio in background
ar: تشغيل الصوت في الخلفية

source: Keeps the movie list open whilst playing audio files.
ar: تحافظ على الفيلم في القائمة مفتوح أثناء تشغيل الملفات الصوتية.

source: Root directory
ar: دليل الملفات

source: Sets the root directory of movie list, to remove the '..' from being shown in that folder.
ar: لتحديد مسار الرووت لقائمة الأفلام، لإزالة ".." من العرض في هذا المجلد.

source: Hide known extensions
ar: إخفاء الأمتدادات المعروفة

source: Allows you to hide the extensions of known file types.
ar: يسمح لك بإخفاء ملحقات أنواع الملفات المعروفة.

source: Show live tv when movie stopped
ar: عرض البث التلفزيوني المباشر عندما يتوقف الفيلم

source: When set the PIG will return to live after a movie has stopped playing.
ar: عند الضبط سيعود تشغيل الفيلم من أخر توقف له عن التشغيل.

source: Really close without saving settings?
ar: هل تريد الخروج بدون حفظ الإعدادات ؟

source: No
ar: لا

source: Sky Planner
ar: مخطط سكاي

source: Slyk Q Planner
ar: مخطط Slyk Q

source: Slyk Onyx Planner
ar: مخطط إسكين Slyk Onyx

source: VSkin Planner
ar: مخطط VSkin

source: Sky UK
ar: سكاي الأنجليزيه

source: OSN Arabic
ar: OSN العربية

source: Press OK
ar: أضغط موافق

source: ServiceName
ar: اسم الحدث

source: ServicePicon
ar: ايقونه الحدث

source: KiddaC Skin E2sentials
ar: إسكين كيداك لأساسيات الاينجما2

source: Settings
ar: الإعدادات

source: Back
ar: عودة الى الخلف

source: Save
ar: حفظ

source: No OSN categories selected. Please enter a some categories to show images for.
ar: لم يتم تحديد فئات OSN. الرجاء إدخال بعض الفئات لعرض الصور لها.

source: No Sky categories selected. Please enter a some categories to show images for.
ar: لم يتم تحديد فئات سكاي. الرجاء إدخال بعض الفئات لعرض الصور لها.

source: Download Images
ar: تحميل الصور

source: Refresh Images
ar: تحديث الصور

source: You need to restart the GUI
ar: الأينجما تحتاج إلى إعادة تشغيل

source: Do you want to restart now?
ar: هل تريد إعادة التشغيل الآن؟

source: Enable Screen Names Debug
ar: تفعيل إظهار أسماء الشاشة

source: Enable Movie Planner Mod
ar: تفعيل تعديل مخطط الأفلام

source: Enable Top Picks Mod
ar: تفعيل وضع تحميل أفضل اللقطات

source: Top Picks image set
ar: إعدادات مجموعة الصور

source: Top Picks download images time
ar: تحديد وقت تحميل الصور

source: Top Picks refresh images every (X) mins...
ar: مده تحديث الصور كل (X) دقيقة ...

source: Top Picks show channel logo overlays
ar: إظهار شعار القناة على البوسترات

source: Top Picks show backdrop programme logo overlay
ar: إظهار خلفية شعار القناه على الباكدروب

source: Show Movie channels
ar: عرض قنوات الأفلام

source: Show General channels
ar: عرض القنوات العامة

source: Show Lifestyle channels
ar: عرض قنوات نمط الحياة

source: Show Arabic channels
ar: عرض القنوات العربية

source: Show Kids channels
ar: عرض قنوات الأطفال

source: Show Sky Lifestyle
ar: عرض سكاي لايف ستايل

source: Show Sky Kids
ar: عرض سكاي للأطفال

source: Show Documentary channels
ar: عرض القنوات الوثائقية

source: Show Crime channels
ar: عرض قنوات الجريمة

source: Show Nature channels
ar: عرض قنوات الطبيعة

source: Show Cinema channels
ar: عرض قنوات السينما

source: Show Sports channels
ar: عرض القنوات الرياضية

source: Show Entertainment channels
ar: عرض القنوات الترفيهية
